#### PointCloudFilterFactory Members

---

|  |
| --- |
| PointCloudFilterFactory Class   Methods   See Also |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateMultiPlaneFilter(IList Plane ) | Creates a new point cloud filter based upon planar boundaries. |
| Public method Static member | CreateMultiPlaneFilter(IList Plane , Int32) | Creates a new point cloud filter based upon planar boundaries. |

# See Also

PointCloudFilterFactory Class

Autodesk.Revit.DB.PointClouds Namespace